КАКерамика_моя_старая_база/src/InformationRegisters/КонтурЛогистика_БазовыеСоответствияНоменклатуры/КонтурЛогистика_БазовыеСоответствияНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>КонтурЛогистика_БазовыеСоответствияНоменклатуры</name>
  <resources>
    <name>Учитывать</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>КоэффициентПересчетаМест</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КоэффициентПересчетаМестОбратный</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>КоэффициентПересчетаКоличествоПаллет</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КодТНВЭД</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ОтгрузочноеНаименование</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>СостояниеГруза</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>МассаБруттоКг</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>17</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ОбъемКубМ</name>
    <comment>Необязательное поле</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>17</precision>
        <scale>5</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>МассаНеттоКг</name>
    <comment>необязательная, обязательная - Брутто</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>17</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>МассаОбъемМеста</name>
    <comment>если истина - будем считать введенный объем и массы места, а не штуки</comment>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ДопИнформация</name>
    <comment>необязательное поле</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ОбъявленнаяЦенность</name>
    <comment>Стоимость (ценность) груза с налогом - всего</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ОбъявленнаяЦенностьВалюта</name>
    <comment>Стоимость (ценность) груза с налогом - всего</comment>
    <type>
      <types>DefinedType.КонтурЛогистика_Валюты</types>
    </type>
  </resources>
  <resources>
    <name>СпособУпаковки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ВидТары</name>
    <type>
      <types>CatalogRef.КонтурЛогистика_КлассификаторУпаковок</types>
    </type>
  </resources>
  <resources>
    <name>Плотность</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>7</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>УчетГрузаВГИС</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ЗначениеМаркировки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ОписаниеОпасногоГруза</name>
    <type>
      <types>CatalogRef.КонтурЛогистика_ОписанияОпасныхГрузов</types>
    </type>
  </resources>
  <resources>
    <name>Высота</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>17</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Длина</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>17</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Ширина</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>17</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Насыпной</name>
    <comment>Насыпной</comment>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>СтранаПроисхождения</name>
    <comment>Страна происхождения продукции</comment>
    <type>
      <types>CatalogRef.КонтурЛогистика_СтраныМира</types>
    </type>
  </resources>
  <resources>
    <name>Крупногабаритный</name>
    <comment>только у крупногабаритных грузов в документе ТРН будут указываться габариты</comment>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>DefinedType.КонтурЛогистика_Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>УпаковкаЕдиницаИзмерения</name>
    <type>
      <types>DefinedType.КонтурЛогистика_УпаковкиЕдиницыИзмерения</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Характеристика</name>
    <type>
      <types>DefinedType.КонтурЛогистика_ХарактеристикиНоменклатуры</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

КАКерамика_моя_старая_база/src/InformationRegisters/КонтурЛогистика_БазовыеСоответствияНоменклатуры/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Процедура ПрисвоитьСоответствиеНоменклатуры(Номенклатура, СтруктураПрисвоения, РежимПрисвоения = ЛОЖЬ, ЗаменитьЕдиницуИзмерения = Неопределено) Экспорт
	
	// раскомментировать и привести в чувства
	
	//Если ЗаменитьЕдиницуИзмерения = Неопределено Тогда 
	//	ЗаменитьЕдиницуИзмерения = Истина;
	//КонецЕсли;
	//
	//// 1. ПОДГОТОВКА К ПРИСВАИВАНИЮ
	//
	//Если СтруктураПрисвоения.Свойство("УпаковкаЕдиницаИзмерения") И ЗначениеЗаполнено(СтруктураПрисвоения.УпаковкаЕдиницаИзмерения) Тогда
	//	
	//	ПрисваиваемаяУпаковкаЕдиницаИзмерения = СтруктураПрисвоения.УпаковкаЕдиницаИзмерения;
	//	
	//Иначе
	//	
	//	ПрисваиваемаяУпаковкаЕдиницаИзмерения = КонтурЛогистика_ОбщегоНазначенияСервер.ПолучитьБазовуюЕдиницуИзмерения(Номенклатура);
	//	
	//КонецЕсли;
	//	
	//НаборОбрабатываемыхЗаписей = РегистрыСведений.КонтурЛогистика_БазовыеСоответствияНоменклатуры.СоздатьНаборЗаписей();
	//НаборОбрабатываемыхЗаписей.Отбор.Номенклатура.Установить(Номенклатура);
	//
	//КоэффициентУстанавливается = Ложь;
	//
	//// Если устанавливается коэффициент - то это только по основной единице а остальные можно ставить по всем
	//Если СтруктураПрисвоения.Свойство("КоэффициентПересчета") 
	//	ИЛИ СтруктураПрисвоения.Свойство("ШтукВУпаковке") 
	//	ИЛИ СтруктураПрисвоения.Свойство("ШтукВТранспортнойУпаковкеТогда") Тогда
	//	
	//	НаборОбрабатываемыхЗаписей.Отбор.УпаковкаЕдиницаИзмерения.Установить(ПрисваиваемаяУпаковкаЕдиницаИзмерения);
	//	КоэффициентУстанавливается = Истина;
	//	
	//КонецЕсли;
	//
	//Если Не ЗначениеЗаполнено(ПрисваиваемаяУпаковкаЕдиницаИзмерения) И КоэффициентУстанавливается Тогда 
	//	Сообщить("Не удалось определить основную единицу измерения у " + Номенклатура + " или она не указана - не могу записать базовое соответствие");
	//	Возврат;
	//КонецЕсли;
	//
	//Если СтруктураПрисвоения.Свойство("Характеристика") И ЗначениеЗаполнено(СтруктураПрисвоения.Характеристика) Тогда
	//	
	//	НаборОбрабатываемыхЗаписей.Отбор.Характеристика.Установить(СтруктураПрисвоения.Характеристика);
	//	
	//Иначе
	//	
	//	ЗаданныйСправочникХарактеристик = КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп20.ПолучитьТипЗначенияОбъекта("Характеристика", Истина, Истина);
	//	Если КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп20.ИспользоватьХарактеристикиНоменклатуры() 
	//		И ЗначениеЗаполнено(ЗаданныйСправочникХарактеристик) Тогда 
	//		Попытка
	//			
	//			ИмяКонфигурации = КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп20.ОпределитьКонфигурацию();
	//			ВладелецХарактеристикВСправочнике = Неопределено;
	//			
	//			// Для типовых - используем штатные обработчики
	//			// Для нетиповых предполагаем что Номенклатура - указана как Владелец в справочнике Характеристик.
	//			ОпределитьВладельцаХарактеристикиВСправочнике(ВладелецХарактеристикВСправочнике, ИмяКонфигурации, Номенклатура);
	//			
	//			МассивХарактеристик = ПолучитьХарактеристикиПоВладельцу(ВладелецХарактеристикВСправочнике);
	//			
	//			Если МассивХарактеристик.Количество() > 0 Тогда
	//				
	//				Для Каждого текХарактериситка Из МассивХарактеристик Цикл
	//					
	//					СтруктураПрисвоения.Вставить("Характеристика", текХарактериситка);
	//					ПрисвоитьСоответствиеНоменклатуры(Номенклатура, СтруктураПрисвоения);
	//					
	//				КонецЦикла;
	//				
	//				Возврат;
	//				
	//			КонецЕсли;
	//			
	//		Исключение
	//			
	//			// Явно будем падать
	//			КонтурЛогистика_Метрика.Метрика_Отправить_Ошибку(, "ПрисвоитьСоответствиеНоменклатуры", ОписаниеОшибки(), "Не могу обработать установку характеристики для номенклатуры");
	//			
	//			ВызватьИсключение "Не могу обработать установку характеристики для номенклатуры. Проверьте, возможно надо отключтиь характеристики. Или обратитесь в техподдержку. " +
	//			Символы.ПС + ОписаниеОшибки();
	//			
	//		КонецПопытки;
	//		
	//	КонецЕсли;
	//	
	//КонецЕсли;
	//
	//// 2. САМО ПРИСВАИВАНИЕ
	//
	//НаборОбрабатываемыхЗаписей.Прочитать();
	//
	//Если НаборОбрабатываемыхЗаписей.Количество() = 0 Тогда
	//	
	//	НаборЗаписейПростановкиЕдиницыИзмерения = РегистрыСведений.КонтурЛогистика_БазовыеСоответствияНоменклатуры.СоздатьНаборЗаписей();
	//	НаборЗаписейПростановкиЕдиницыИзмерения.Отбор.Номенклатура.Установить(Номенклатура);
	//	Если СтруктураПрисвоения.Свойство("Характеристика") И ЗначениеЗаполнено(СтруктураПрисвоения.Характеристика) Тогда
	//		НаборЗаписейПростановкиЕдиницыИзмерения.Отбор.Характеристика.Установить(СтруктураПрисвоения.Характеристика);
	//	КонецЕсли;
	//	
	//	НаборЗаписейПростановкиЕдиницыИзмерения.Прочитать();
	//	
	//	Если НаборЗаписейПростановкиЕдиницыИзмерения.Количество() > 0 И ЗаменитьЕдиницуИзмерения = Истина Тогда
	//		
	//		Для Каждого Запись Из НаборЗаписейПростановкиЕдиницыИзмерения Цикл
	//			
	//			Если Не ЗначениеЗаполнено(Запись.УпаковкаЕдиницаИзмерения) Тогда
	//				
	//				СуществующаяЗапись = НаборЗаписейПростановкиЕдиницыИзмерения[0];
	//				ЗаполнитьЗначенияСвойств(СуществующаяЗапись, СтруктураПрисвоения);
	//				СуществующаяЗапись.Номенклатура = Номенклатура;
	//				Если КоэффициентУстанавливается Тогда 
	//					СуществующаяЗапись.УпаковкаЕдиницаИзмерения = ПрисваиваемаяУпаковкаЕдиницаИзмерения;
	//				КонецЕсли;
	//				
	//				НаборЗаписейПростановкиЕдиницыИзмерения.ДополнительныеСвойства.Вставить("РежимПрисвоения", РежимПрисвоения);	

	//				НаборЗаписейПростановкиЕдиницыИзмерения.Записать();
	//				НаборЗаписейПростановкиЕдиницыИзмерения.Очистить();
	//				Прервать;
	//				
	//			КонецЕсли;
	//			
	//		КонецЦикла;
	//		
	//	Иначе
	//		
	//		НоваяЗапись = НаборОбрабатываемыхЗаписей.Добавить();
	//		НоваяЗапись.Номенклатура = Номенклатура;
	//		НоваяЗапись.УпаковкаЕдиницаИзмерения = ПрисваиваемаяУпаковкаЕдиницаИзмерения;
	//		
	//		ЗаполнитьЗначенияСвойств(НоваяЗапись, СтруктураПрисвоения);
	//		
	//		НаборОбрабатываемыхЗаписей.ДополнительныеСвойства.Вставить("РежимПрисвоения", РежимПрисвоения);	
	//		НаборОбрабатываемыхЗаписей.Записать();
	//		
	//	КонецЕсли;
	//	
	//	
	//ИначеЕсли НаборОбрабатываемыхЗаписей.Количество() = 1 Тогда
	//	
	//	СуществующаяЗапись = НаборОбрабатываемыхЗаписей[0];
	//	
	//	Если Не ЗначениеЗаполнено(СуществующаяЗапись.УпаковкаЕдиницаИзмерения) Тогда
	//		СуществующаяЗапись.УпаковкаЕдиницаИзмерения = ПрисваиваемаяУпаковкаЕдиницаИзмерения;
	//	КонецЕсли;
	//	
	//	ЗаполнитьЗначенияСвойств(СуществующаяЗапись, СтруктураПрисвоения);
	//	
	//	НаборОбрабатываемыхЗаписей.ДополнительныеСвойства.Вставить("РежимПрисвоения", РежимПрисвоения);
	//	НаборОбрабатываемыхЗаписей.Записать();
	//	
	//Иначе//Если НаборОбрабатываемыхЗаписей.Количество() > 1 Тогда
	//	
	//	Попытка
	//		
	//		Для Каждого СуществующаяЗапись Из НаборОбрабатываемыхЗаписей Цикл
	//			ЗаполнитьЗначенияСвойств(СуществующаяЗапись, СтруктураПрисвоения);
	//			
	//		КонецЦикла;
	//		
	//		НаборОбрабатываемыхЗаписей.Записать();
	//		
	//	Исключение
	//		Сообщить("Не удалось присвоить соответствия по причине: " + ОписаниеОшибки());
	//	КонецПопытки;
	//	
	//КонецЕсли;
	//
	//Если СтруктураПрисвоения.Свойство("Характеристика") Тогда
	//	СтруктураПрисвоения.Характеристика = Неопределено;	
	//КонецЕсли;
	//
	//НаборОбрабатываемыхЗаписей.Очистить();
	
КонецПроцедуры

Функция КоличествоСоответствийНоменклатуры(СтруктураЗаписиОтбора, УпаковкаЕдиницаИзмерения) Экспорт

	ВыборкаПоНоменклатуре = РегистрыСведений.КонтурЛогистика_БазовыеСоответствияНоменклатуры.Выбрать(СтруктураЗаписиОтбора);
	СоответствийПоНоменклатуре = 0;																												 
	Пока ВыборкаПоНоменклатуре.Следующий() Цикл
		Если ВыборкаПоНоменклатуре.УпаковкаЕдиницаИзмерения = УпаковкаЕдиницаИзмерения Тогда 
			СоответствийПоНоменклатуре = СоответствийПоНоменклатуре + 1;
		КонецЕсли;
	КонецЦикла;
		
	Возврат СоответствийПоНоменклатуре;

КонецФункции

Функция КлючПервогоСоответствияНоменклатуры(СтруктураЗаписиОтбора) Экспорт

	Результат = Новый Структура();
	
	Результат.Вставить("Номенклатура", Неопределено);
	Результат.Вставить("УпаковкаЕдиницаИзмерения", Неопределено);
	Результат.Вставить("Характеристика", Неопределено);
	
	ВыборкаПоНоменклатуре = РегистрыСведений.КонтурЛогистика_БазовыеСоответствияНоменклатуры.Выбрать(СтруктураЗаписиОтбора);
	
	Если ВыборкаПоНоменклатуре.Следующий() Тогда  
		ЗаполнитьЗначенияСвойств(Результат, ВыборкаПоНоменклатуре);
	КонецЕсли;
	
	Возврат Результат;

КонецФункции

#КонецЕсли
